; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	spectrograph3 - mode
	image2 - mode
	image1 - mode
	thermograph4 - mode
	image5 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 image1)
	(supports instrument1 image5)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 image5)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet7 image2)
	(have_image Planet7 thermograph4)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon9 image2)
	(have_image Star10 thermograph4)
	(have_image Star10 image1)
	(have_image Star11 thermograph4)
	(have_image Star11 image5)
	(have_image Phenomenon12 thermograph4)
	(have_image Phenomenon13 image2)
	(have_image Phenomenon13 thermograph4)
	(have_image Planet14 spectrograph3)
	(have_image Phenomenon15 thermograph4)
	(have_image Phenomenon15 image1)
))

)

; plan
1. (turn_to satellite1 groundstation1 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 16
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 16
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 16
4. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   goals met: 0 of 16
5. (take_image satellite1 planet7 instrument2 image2)
   added: (have_image planet7 image2)
   goals met: 1 of 16
6. (turn_to satellite1 phenomenon9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 16
7. (take_image satellite1 phenomenon9 instrument2 image2)
   added: (have_image phenomenon9 image2)
   goals met: 2 of 16
8. (turn_to satellite1 phenomenon13 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 16
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 16
10. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 16
11. (take_image satellite1 phenomenon13 instrument2 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 16
12. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 3 of 16
13. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 16
14. (turn_to satellite0 phenomenon12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 16
15. (take_image satellite0 phenomenon12 instrument0 thermograph4)
   added: (have_image phenomenon12 thermograph4)
   goals met: 4 of 16
16. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 16
17. (take_image satellite0 phenomenon13 instrument0 thermograph4)
   added: (have_image phenomenon13 thermograph4)
   goals met: 5 of 16
18. (turn_to satellite0 phenomenon15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 16
19. (take_image satellite0 phenomenon15 instrument0 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 6 of 16
20. (turn_to satellite0 phenomenon8 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 16
21. (take_image satellite0 phenomenon8 instrument0 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 7 of 16
22. (turn_to satellite0 planet14 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet14)
   goals met: 7 of 16
23. (take_image satellite0 planet14 instrument0 spectrograph3)
   added: (have_image planet14 spectrograph3)
   goals met: 8 of 16
24. (turn_to satellite0 planet7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet7)
   goals met: 8 of 16
25. (take_image satellite0 planet7 instrument0 thermograph4)
   added: (have_image planet7 thermograph4)
   goals met: 9 of 16
26. (turn_to satellite0 star10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star10)
   goals met: 9 of 16
27. (take_image satellite0 star10 instrument0 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 10 of 16
28. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 10 of 16
29. (take_image satellite0 star11 instrument0 thermograph4)
   added: (have_image star11 thermograph4)
   goals met: 11 of 16
30. (turn_to satellite0 star4 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star4)
   goals met: 12 of 16
31. (turn_to satellite1 groundstation0 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation0)
   goals met: 12 of 16
32. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 12 of 16
33. (turn_to satellite1 phenomenon15 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon15)
   goals met: 12 of 16
34. (take_image satellite1 phenomenon15 instrument1 image1)
   added: (have_image phenomenon15 image1)
   goals met: 13 of 16
35. (turn_to satellite1 phenomenon8 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon8)
   goals met: 13 of 16
36. (take_image satellite1 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 14 of 16
37. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 14 of 16
38. (take_image satellite1 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 15 of 16
39. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 15 of 16
40. (take_image satellite1 star11 instrument1 image5)
   added: (have_image star11 image5)
   goals met: 16 of 16
